app/controllers/articles_controller.rb

  def index
    if params[:tag]
      @articles = Article.tagged_with(params[:tag])
    else
      @articles = Article.all
---
SELECT `articles`.* FROM `articles` JOIN taggings articles_taggings_a4983d2 ON articles_taggings_a4983d2.taggable_id = articles.id AND articles_taggings_a4983d2.taggable_type = 'Article' AND articles_taggings_a4983d2.tag_id = 12
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN articles ON articles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Article' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT articles.id FROM `articles` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`content`, `created_at`, `name`, `updated_at`) VALUES ('Developer: Epic\r\nPlatforms: PC, Mac, Xbox 360, PS3\r\nBrowser support: No\r\nCost: Available on request\r\nPublished titles: Mass Effect (Bioware), The Last Remnant (Square Enix), Lost Odyssey (Mistwalker), The Wheelman (Midway)\r\nTitles in development: Alpha Protocol (Obsidian), DC Universe Online (SOE), Alien Breed (Team 17)\r\nMiddleware integrations: Fonix, SpeedTree, GameSpy, Scaleform GFx, PhysX, Illuminate Labs, Umbra, morpheme, nFringe, HumanIK, Kynapse, Bink, ProFX, AI.implant, Quazal, DigiMask, Game-Link, Wwise, Enlighten', '2013-02-19 14:54:18', 'Unreal Engine 3', '2013-02-19 14:54:18')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `content` = 'Developer: Epic / \r\nPlatforms: PC, Mac, Xbox 360, PS3 / \r\nBrowser support: No / \r\nCost: Available on request / \r\nPublished titles: Mass Effect (Bioware), The Last Remnant (Square Enix), Lost Odyssey (Mistwalker), The Wheelman (Midway) / \r\nTitles in development: Alpha Protocol (Obsidian), DC Universe Online (SOE), Alien Breed (Team 17) / \r\nMiddleware integrations: Fonix, SpeedTree, GameSpy, Scaleform GFx, PhysX, Illuminate Labs, Umbra, morpheme, nFringe, HumanIK, Kynapse, Bink, ProFX, AI.implant, Quazal, DigiMask, Game-Link, Wwise, Enlighten', `updated_at` = '2013-02-19 15:06:15' WHERE `articles`.`id` = 1